apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_spi.c
/****************************************************************************
 * arch/risc-v/src/gd32vw55x/gd32vw55x_spi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * The external functions, gd32_spi0select, gd32_spi0status and
 * gd32_spi0cmddata must be provided by board-specific logic.  They are
 * implementations of the select, status and cmddata methods of the SPI
 * interface defined by struct spi_ops_s (see include/nuttx/spi/spi.h).
 * All other methods (including gd32_spibus_initialize()) are provided by
 * common GD32VW55x logic.  To use this common SPI logic on your board:
 *
 *   1. Provide logic in gd32vw55x_boardinitialize() to configure the SPI
 *      chip select pins.
 *   2. Provide gd32_spi0select() and gd32_spi0status() functions in your
 *      board-specific logic.  These functions will perform chip selection
 *      and status operations using GPIOs in the way your board is
 *      configured.  Weak default implementations are provided here so that
 *      a board that does not need them still links.
 *   3. Add a call to gd32_spibus_initialize() in your low level application
 *      initialization logic.
 *   4. The handle returned by gd32_spibus_initialize() may then be used to
 *      bind the SPI driver to higher level logic.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/spi/spi.h>

#include <arch/board/board.h>

#include "riscv_internal.h"

#include "chip.h"
#include "gd32vw55x_clockconfig.h"
#include "gd32vw55x_gpio.h"
#include "gd32vw55x_spi.h"
#include "hardware/gd32vw55x_rcu.h"

#ifdef CONFIG_GD32VW55X_SPI_DMA
#  include "gd32vw55x_dma.h"
#endif

#ifdef CONFIG_GD32VW55X_SPI

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* The SPI is clocked from CK_APB2.  The maximum SCK frequency of the
 * GD32VW553 is 40 MHz (datasheet Table 4-31).
 */

#define GD32_SPI_CLK_MAX        (40000000ul)
#define GD32_SPI_CLK_INIT       (400000ul)

/* Bits of CTL0 that are preserved when the bus is (re-)initialized: the
 * CRC enable and the data frame format.
 */

#define SPI_INIT_MASK           (SPI_CTL0_CRCEN | SPI_CTL0_FF16)

#ifdef CONFIG_GD32VW55X_SPI_DMA

/* The DMA interrupts that are enabled while an SPI DMA is in progress */

#  define SPI_DMA_INTEN         (DMA_INT_MASK)

/* SPI DMA priority */

#  ifndef SPI_DMA_PRIO
#    define SPI_DMA_PRIO        DMA_PRIO_MEDIUM_SELECT
#  endif

#endif /* CONFIG_GD32VW55X_SPI_DMA */

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct gd32_spidev_s
{
  struct spi_dev_s  spidev;      /* Externally visible part of the SPI
                                  * interface */
  uint32_t          spibase;     /* SPI base address */
  uint32_t          spiclock;    /* Clocking for the SPI module */
  uint32_t          frequency;   /* Requested clock frequency */
  uint32_t          actual;      /* Actual clock frequency */
  mutex_t           lock;        /* Held while the bus is locked */
  uint8_t           nbits;       /* Width of word in bits (8 or 16) */
  uint8_t           mode;        /* Mode 0,1,2,3 */
#ifdef CONFIG_GD32VW55X_SPI_DMA
  volatile uint16_t rxresult;    /* Result of the RX DMA */
  volatile uint16_t txresult;    /* Result of the TX DMA */
#ifdef CONFIG_SPI_TRIGGER
  bool              defertrig;   /* Trigger should be deferred */
  bool              trigarmed;   /* The trigger is armed */
#endif
  uint8_t           rxch;        /* The RX DMA channel request */
  uint8_t           txch;        /* The TX DMA channel request */
  DMA_HANDLE        rxdma;       /* DMA channel handle for RX transfers */
  DMA_HANDLE        txdma;       /* DMA channel handle for TX transfers */
  sem_t             rxsem;       /* Wait for RX DMA to complete */
  sem_t             txsem;       /* Wait for TX DMA to complete */
#endif
  bool              initialized; /* Has the SPI been initialized */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Clock */

static void     gd32_spi_reset(void);
static void     gd32_spi_clock_enable(void);
static void     gd32_spi_clock_disable(void);

/* Helpers */

static inline uint32_t spi_getreg(struct gd32_spidev_s *priv,
                                  uint32_t offset);
static inline void     spi_putreg(struct gd32_spidev_s *priv,
                                  uint32_t offset, uint32_t value);
static void            spi_modifyreg(struct gd32_spidev_s *priv,
                                     uint32_t offset, uint32_t setbits,
                                     uint32_t clrbits);
static inline uint16_t spi_readword(struct gd32_spidev_s *priv);
static inline void     spi_writeword(struct gd32_spidev_s *priv,
                                     uint16_t word);

/* SPI methods */

static int      spi_lock(struct spi_dev_s *dev, bool lock);
static uint32_t spi_setfrequency(struct spi_dev_s *dev, uint32_t frequency);
static void     spi_setmode(struct spi_dev_s *dev, enum spi_mode_e mode);
static void     spi_setbits(struct spi_dev_s *dev, int nbits);
#ifdef CONFIG_SPI_HWFEATURES
static int      spi_hwfeatures(struct spi_dev_s *dev,
                               spi_hwfeatures_t features);
#endif
static uint32_t spi_send(struct spi_dev_s *dev, uint32_t wd);
static void     spi_exchange(struct spi_dev_s *dev, const void *txbuffer,
                             void *rxbuffer, size_t nwords);
#ifdef CONFIG_SPI_TRIGGER
static int      spi_trigger(struct spi_dev_s *dev);
#endif
#ifndef CONFIG_SPI_EXCHANGE
static void     spi_sndblock(struct spi_dev_s *dev, const void *txbuffer,
                             size_t nwords);
static void     spi_recvblock(struct spi_dev_s *dev, void *rxbuffer,
                              size_t nwords);
#endif

/* DMA support */

#ifdef CONFIG_GD32VW55X_SPI_DMA
static int      spi_dmarxwait(struct gd32_spidev_s *priv);
static int      spi_dmatxwait(struct gd32_spidev_s *priv);
static void     spi_dmarxcallback(DMA_HANDLE handle, uint16_t isr,
                                  void *arg);
static void     spi_dmatxcallback(DMA_HANDLE handle, uint16_t isr,
                                  void *arg);
static void     spi_dmarxsetup(struct gd32_spidev_s *priv, void *rxbuffer,
                               void *rxdummy, size_t nwords);
static void     spi_dmatxsetup(struct gd32_spidev_s *priv,
                               const void *txbuffer, const void *txdummy,
                               size_t nwords);
static inline void spi_dmarxstart(struct gd32_spidev_s *priv);
static inline void spi_dmatxstart(struct gd32_spidev_s *priv);
static void     spi_exchange_nodma(struct spi_dev_s *dev,
                                   const void *txbuffer, void *rxbuffer,
                                   size_t nwords);
#endif

/* Initialization */

static void     spi_bus_initialize(struct gd32_spidev_s *priv);
static void     gd32_spi_gpio_config(void);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct spi_ops_s g_spi0ops =
{
  .lock              = spi_lock,
  .select            = gd32_spi0select,
  .setfrequency      = spi_setfrequency,
  .setmode           = spi_setmode,
  .setbits           = spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = spi_hwfeatures,
#endif
  .status            = gd32_spi0status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = gd32_spi0cmddata,
#endif
  .send              = spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = spi_exchange,
#else
  .sndblock          = spi_sndblock,
  .recvblock         = spi_recvblock,
#endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = spi_trigger,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = gd32_spi0register,  /* Provided externally */
#else
  .registercallback  = NULL,               /* Not implemented */
#endif
};

static struct gd32_spidev_s g_spi0dev =
{
  .spidev   =
  {
    .ops    = &g_spi0ops
  },
  .spibase  = GD32VW55X_SPI_BASE,
  .spiclock = GD32VW55X_PCLK2_FREQ,
  .lock     = NXMUTEX_INITIALIZER,
#ifdef CONFIG_GD32VW55X_SPI_DMA
  .rxch     = DMA_REQ_SPI_RX,
  .txch     = DMA_REQ_SPI_TX,
  .rxsem    = SEM_INITIALIZER(0),
  .txsem    = SEM_INITIALIZER(0),
#endif
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_spi_reset
 *
 * Description:
 *   Reset the SPI peripheral
 *
 ****************************************************************************/

static void gd32_spi_reset(void)
{
  modifyreg32(GD32VW55X_RCU_APB2RST, 0, RCU_APB2RST_SPIRST);
  modifyreg32(GD32VW55X_RCU_APB2RST, RCU_APB2RST_SPIRST, 0);
}

/****************************************************************************
 * Name: gd32_spi_clock_enable
 *
 * Description:
 *   Enable the SPI clock
 *
 ****************************************************************************/

static void gd32_spi_clock_enable(void)
{
  modifyreg32(GD32VW55X_RCU_APB2EN, 0, RCU_APB2EN_SPIEN);
}

/****************************************************************************
 * Name: gd32_spi_clock_disable
 *
 * Description:
 *   Disable the SPI clock
 *
 ****************************************************************************/

static void gd32_spi_clock_disable(void)
{
  modifyreg32(GD32VW55X_RCU_APB2EN, RCU_APB2EN_SPIEN, 0);
}

/****************************************************************************
 * Name: spi_getreg
 *
 * Description:
 *   Get the contents of the SPI register at offset
 *
 * Input Parameters:
 *   priv   - Private SPI device structure
 *   offset - Offset to the register of interest
 *
 * Returned Value:
 *   The contents of the 32-bit register
 *
 ****************************************************************************/

static inline uint32_t spi_getreg(struct gd32_spidev_s *priv,
                                  uint32_t offset)
{
  return getreg32(priv->spibase + offset);
}

/****************************************************************************
 * Name: spi_putreg
 *
 * Description:
 *   Write a 32-bit value to the SPI register at offset
 *
 * Input Parameters:
 *   priv   - Private SPI device structure
 *   offset - Offset to the register of interest
 *   value  - The value to be written
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void spi_putreg(struct gd32_spidev_s *priv,
                              uint32_t offset, uint32_t value)
{
  putreg32(value, priv->spibase + offset);
}

/****************************************************************************
 * Name: spi_modifyreg
 *
 * Description:
 *   Clear and set bits in an SPI register
 *
 * Input Parameters:
 *   priv    - Private SPI device structure
 *   offset  - Offset to the register of interest
 *   setbits - The bits to set
 *   clrbits - The bits to clear
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_modifyreg(struct gd32_spidev_s *priv, uint32_t offset,
                          uint32_t setbits, uint32_t clrbits)
{
  uint32_t regval;

  regval  = spi_getreg(priv, offset);
  regval &= ~clrbits;
  regval |= setbits;
  spi_putreg(priv, offset, regval);
}

/****************************************************************************
 * Name: spi_wait_status
 *
 * Description:
 *   Wait until all of the bits in 'status' are set in the STAT register
 *
 * Input Parameters:
 *   priv   - Private SPI device structure
 *   status - The bits to wait for
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void spi_wait_status(struct gd32_spidev_s *priv,
                                   uint32_t status)
{
  while (status != (spi_getreg(priv, GD32VW55X_SPI_STAT_OFFSET) & status))
    {
    }
}

/****************************************************************************
 * Name: spi_readword
 *
 * Description:
 *   Read one word from the SPI data register
 *
 * Input Parameters:
 *   priv - Private SPI device structure
 *
 * Returned Value:
 *   The word as read
 *
 ****************************************************************************/

static inline uint16_t spi_readword(struct gd32_spidev_s *priv)
{
  /* Wait until the receive buffer is not empty */

  spi_wait_status(priv, SPI_STAT_RBNE);

  /* Return the data */

  return (uint16_t)spi_getreg(priv, GD32VW55X_SPI_DATA_OFFSET);
}

/****************************************************************************
 * Name: spi_writeword
 *
 * Description:
 *   Write one word to the SPI data register
 *
 * Input Parameters:
 *   priv - Private SPI device structure
 *   word - The word to send
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void spi_writeword(struct gd32_spidev_s *priv, uint16_t word)
{
  /* Wait until the transmit buffer is empty */

  spi_wait_status(priv, SPI_STAT_TBE);

  /* Then send the word */

  spi_putreg(priv, GD32VW55X_SPI_DATA_OFFSET, (uint32_t)word);
}

/****************************************************************************
 * Name: spi_lock
 *
 * Description:
 *   On SPI buses where there are multiple devices, it will be necessary to
 *   lock SPI to have exclusive access to the bus for a sequence of
 *   transfers.  The bus should be locked before the chip is selected.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   lock - true: Lock the SPI bus, false: unlock the SPI bus
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure
 *
 ****************************************************************************/

