apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_spi.c
static int spi_lock(struct spi_dev_s *dev, bool lock)
{
  struct gd32_spidev_s *priv = (struct gd32_spidev_s *)dev;
  int ret;

  if (lock)
    {
      ret = nxmutex_lock(&priv->lock);
    }
  else
    {
      ret = nxmutex_unlock(&priv->lock);
    }

  return ret;
}

/****************************************************************************
 * Name: spi_setfrequency
 *
 * Description:
 *   Set the SPI frequency
 *
 * Input Parameters:
 *   dev       - Device-specific state data
 *   frequency - The SPI frequency requested
 *
 * Returned Value:
 *   Returns the actual frequency selected
 *
 ****************************************************************************/

static uint32_t spi_setfrequency(struct spi_dev_s *dev, uint32_t frequency)
{
  struct gd32_spidev_s *priv = (struct gd32_spidev_s *)dev;
  uint32_t setbits;
  uint32_t actual;
  uint32_t plk_div;

  /* Check if the requested frequency is the current selection */

  if (priv->frequency == frequency)
    {
      return priv->actual;
    }

  /* Check if the requested frequency is reasonable */

  if (frequency > GD32_SPI_CLK_MAX)
    {
      frequency = GD32_SPI_CLK_MAX;
    }
  else if (frequency == 0)
    {
      frequency = GD32_SPI_CLK_INIT;
    }

  /* Configure the SCK frequency:
   *
   *   SCK frequency = PCLK / plk_div, or plk_div = PCLK / frequency
   */

  plk_div = priv->spiclock / frequency;

  if (plk_div < 2)
    {
      plk_div = 2;
    }
  else if (plk_div > 256)
    {
      plk_div = 256;
    }

  if (plk_div > 128)
    {
      setbits = SPI_CTL0_PSC_256;
    }
  else if (plk_div > 64)
    {
      setbits = SPI_CTL0_PSC_128;
    }
  else if (plk_div > 32)
    {
      setbits = SPI_CTL0_PSC_64;
    }
  else if (plk_div > 16)
    {
      setbits = SPI_CTL0_PSC_32;
    }
  else if (plk_div > 8)
    {
      setbits = SPI_CTL0_PSC_16;
    }
  else if (plk_div > 4)
    {
      setbits = SPI_CTL0_PSC_8;
    }
  else if (plk_div > 2)
    {
      setbits = SPI_CTL0_PSC_4;
    }
  else
    {
      setbits = SPI_CTL0_PSC_2;
    }

  /* The prescaler can only be changed while the SPI is disabled */

  spi_modifyreg(priv, GD32VW55X_SPI_CTL0_OFFSET, 0, SPI_CTL0_SPIEN);
  spi_modifyreg(priv, GD32VW55X_SPI_CTL0_OFFSET, setbits,
                SPI_CTL0_PSC_MASK);
  spi_modifyreg(priv, GD32VW55X_SPI_CTL0_OFFSET, SPI_CTL0_SPIEN, 0);

  actual = priv->spiclock >> ((setbits >> SPI_CTL0_PSC_SHIFT) + 1);

  spiinfo("Frequency %" PRIu32 "->%" PRIu32 "\n", frequency, actual);

  /* Save the frequency selection so that subsequent reconfigurations will
   * be faster.
   */

  priv->frequency = frequency;
  priv->actual    = actual;

  return priv->actual;
}

/****************************************************************************
 * Name: spi_setmode
 *
 * Description:
 *   Set the SPI mode.  See enum spi_mode_e for the mode definitions
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   mode - The SPI mode requested
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_setmode(struct spi_dev_s *dev, enum spi_mode_e mode)
{
  struct gd32_spidev_s *priv = (struct gd32_spidev_s *)dev;
  uint32_t setbits;

  spiinfo("mode=%d\n", mode);

  /* Has the mode changed? */

  if (mode != priv->mode)
    {
      switch (mode)
        {
        case SPIDEV_MODE0: /* CKPL=0, CKPH=0 */
          setbits = 0;
          break;

        case SPIDEV_MODE1: /* CKPL=0, CKPH=1 */
          setbits = SPI_CTL0_CKPH;
          break;

        case SPIDEV_MODE2: /* CKPL=1, CKPH=0 */
          setbits = SPI_CTL0_CKPL;
          break;

        case SPIDEV_MODE3: /* CKPL=1, CKPH=1 */
          setbits = SPI_CTL0_CKPH | SPI_CTL0_CKPL;
          break;

        default:
          return;
        }

      /* The clock configuration can only be changed while the SPI is
       * disabled.
       */

      spi_modifyreg(priv, GD32VW55X_SPI_CTL0_OFFSET, 0, SPI_CTL0_SPIEN);
      spi_modifyreg(priv, GD32VW55X_SPI_CTL0_OFFSET, setbits,
                    SPI_CTL0_CKPH | SPI_CTL0_CKPL);
      spi_modifyreg(priv, GD32VW55X_SPI_CTL0_OFFSET, SPI_CTL0_SPIEN, 0);

      /* Save the mode so that subsequent re-configurations will be
       * faster.
       */

      priv->mode = mode;
    }
}

/****************************************************************************
 * Name: spi_setbits
 *
 * Description:
 *   Set the number of bits per word
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   nbits - The number of bits requested (8 or 16)
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_setbits(struct spi_dev_s *dev, int nbits)
{
  struct gd32_spidev_s *priv = (struct gd32_spidev_s *)dev;
  uint32_t setbits;

  spiinfo("nbits=%d\n", nbits);

  /* The GD32VW55x SPI only supports 8- and 16-bit frames */

  if (nbits != 8 && nbits != 16)
    {
      spierr("ERROR: Unsupported nbits: %d\n", nbits);
      return;
    }

  /* Has the number of bits changed? */

  if (nbits != priv->nbits)
    {
      setbits = (nbits == 16) ? SPI_CTL0_FF16 : 0;

      spi_modifyreg(priv, GD32VW55X_SPI_CTL0_OFFSET, 0, SPI_CTL0_SPIEN);
      spi_modifyreg(priv, GD32VW55X_SPI_CTL0_OFFSET, setbits,
                    SPI_CTL0_FF16);
      spi_modifyreg(priv, GD32VW55X_SPI_CTL0_OFFSET, SPI_CTL0_SPIEN, 0);

      /* Save the selection so that subsequent re-configurations will be
       * faster.
       */

      priv->nbits = nbits;
    }
}

/****************************************************************************
 * Name: spi_hwfeatures
 *
 * Description:
 *   Set hardware-specific feature flags
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   features - H/W feature flags
 *
 * Returned Value:
 *   Zero (OK) if the selected H/W features are enabled; A negated errno
 *   value if any H/W feature is not supportable.
 *
 ****************************************************************************/

#ifdef CONFIG_SPI_HWFEATURES
static int spi_hwfeatures(struct spi_dev_s *dev, spi_hwfeatures_t features)
{
#ifdef CONFIG_SPI_BITORDER
  struct gd32_spidev_s *priv = (struct gd32_spidev_s *)dev;
  uint32_t setbits;

  spiinfo("features=%08" PRIx32 "\n", (uint32_t)features);

