apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_spi.c
  /* Wake up the SPI driver.  The status is OR'ed with 0x0080 to assure that
   * it is non-zero.
   */

  priv->rxresult = isr | 0x0080;
  nxsem_post(&priv->rxsem);
}

/****************************************************************************
 * Name: spi_dmatxcallback
 *
 * Description:
 *   Called when the TX DMA completes
 *
 ****************************************************************************/

static void spi_dmatxcallback(DMA_HANDLE handle, uint16_t isr, void *arg)
{
  struct gd32_spidev_s *priv = (struct gd32_spidev_s *)arg;

  priv->txresult = isr | 0x0080;
  nxsem_post(&priv->txsem);
}

/****************************************************************************
 * Name: spi_dmarxsetup
 *
 * Description:
 *   Setup to perform the RX DMA
 *
 ****************************************************************************/

static void spi_dmarxsetup(struct gd32_spidev_s *priv, void *rxbuffer,
                           void *rxdummy, size_t nwords)
{
  struct gd32_dma_config_s dma_init_struct;

  /* Enable the SPI RX DMA */

  spi_modifyreg(priv, GD32VW55X_SPI_CTL1_OFFSET, SPI_CTL1_DMAREN, 0);

  /* Is there a buffer to receive the data in? */

  if (rxbuffer != NULL)
    {
      dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    }
  else
    {
      rxbuffer = rxdummy;
      dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_DISABLE;
    }

  /* 8- or 16-bit mode? */

  if (priv->nbits > 8)
    {
      dma_init_struct.periph_memory_width = DMA_WIDTH_16BITS_SELECT;
    }
  else
    {
      dma_init_struct.periph_memory_width = DMA_WIDTH_8BITS_SELECT;
    }

  dma_init_struct.direction    = DMA_PERIPH_TO_MEMORY;
  dma_init_struct.memory0_addr = (uint32_t)rxbuffer;
  dma_init_struct.number       = nwords;
  dma_init_struct.periph_addr  = GD32VW55X_SPI_DATA(priv->spibase);
  dma_init_struct.periph_inc   = DMA_PERIPH_INCREASE_DISABLE;
  dma_init_struct.circular_mode = DMA_CIRCULAR_MODE_DISABLE;
  dma_init_struct.priority     = SPI_DMA_PRIO;

  /* Configure the RX DMA */

  gd32_dma_setup(priv->rxdma, &dma_init_struct,
                 GD32_DMA_SINGLE_DATA_MODE);
}

/****************************************************************************
 * Name: spi_dmatxsetup
 *
 * Description:
 *   Setup to perform the TX DMA
 *
 ****************************************************************************/

static void spi_dmatxsetup(struct gd32_spidev_s *priv, const void *txbuffer,
                           const void *txdummy, size_t nwords)
{
  struct gd32_dma_config_s dma_init_struct;

  /* Enable the SPI TX DMA */

  spi_modifyreg(priv, GD32VW55X_SPI_CTL1_OFFSET, SPI_CTL1_DMATEN, 0);

  /* Is there a buffer to transfer the data from? */

  if (txbuffer != NULL)
    {
      dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    }
  else
    {
      txbuffer = txdummy;
      dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_DISABLE;
    }

  /* 8- or 16-bit mode? */

  if (priv->nbits > 8)
    {
      dma_init_struct.periph_memory_width = DMA_WIDTH_16BITS_SELECT;
    }
  else
    {
      dma_init_struct.periph_memory_width = DMA_WIDTH_8BITS_SELECT;
    }

  dma_init_struct.direction    = DMA_MEMORY_TO_PERIPH;
  dma_init_struct.memory0_addr = (uint32_t)txbuffer;
  dma_init_struct.number       = nwords;
  dma_init_struct.periph_addr  = GD32VW55X_SPI_DATA(priv->spibase);
  dma_init_struct.periph_inc   = DMA_PERIPH_INCREASE_DISABLE;
  dma_init_struct.circular_mode = DMA_CIRCULAR_MODE_DISABLE;
  dma_init_struct.priority     = SPI_DMA_PRIO;

  /* Configure the TX DMA */

  gd32_dma_setup(priv->txdma, &dma_init_struct,
                 GD32_DMA_SINGLE_DATA_MODE);
}

/****************************************************************************
 * Name: spi_dmarxstart
 *
 * Description:
 *   Start the RX DMA
 *
 ****************************************************************************/

static inline void spi_dmarxstart(struct gd32_spidev_s *priv)
{
  priv->rxresult = 0;
  gd32_dma_start(priv->rxdma, spi_dmarxcallback, priv, SPI_DMA_INTEN);
}

/****************************************************************************
 * Name: spi_dmatxstart
 *
 * Description:
 *   Start the TX DMA
 *
 ****************************************************************************/

static inline void spi_dmatxstart(struct gd32_spidev_s *priv)
{
  priv->txresult = 0;
  gd32_dma_start(priv->txdma, spi_dmatxcallback, priv, SPI_DMA_INTEN);
}

/****************************************************************************
 * Name: spi_exchange (with DMA capability)
 *
 * Description:
 *   Exchange a block of data on SPI using DMA
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to a buffer in which to receive data
 *   nwords   - The length of data to be exchanged in units of words
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_exchange(struct spi_dev_s *dev, const void *txbuffer,
                         void *rxbuffer, size_t nwords)
{
  struct gd32_spidev_s *priv = (struct gd32_spidev_s *)dev;
  static uint16_t rxdummy = 0xffff;
  static const uint16_t txdummy = 0xffff;
  size_t nbytes;
  int ret;

  DEBUGASSERT(priv != NULL && priv->spibase != 0);

  /* Convert the number of words to a number of bytes */

  nbytes = (priv->nbits > 8) ? nwords << 1 : nwords;
  UNUSED(nbytes);

  if (priv->rxdma == NULL || priv->txdma == NULL ||
      up_interrupt_context()
#ifdef CONFIG_GD32VW55X_SPI_DMATHRESHOLD
      || nbytes <= CONFIG_GD32VW55X_SPI_DMATHRESHOLD
#endif
     )
    {
      /* Invalid DMA channels, or interrupt context: fall back to the
       * non-DMA method.
       */

      spi_exchange_nodma(dev, txbuffer, rxbuffer, nwords);
      return;
    }

  spiinfo("txbuffer=%p rxbuffer=%p nwords=%zu\n",
          txbuffer, rxbuffer, nwords);

  /* Setup the DMAs */

  spi_dmarxsetup(priv, rxbuffer, &rxdummy, nwords);
  spi_dmatxsetup(priv, txbuffer, &txdummy, nwords);

