apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_spi.c
#ifdef CONFIG_SPI_TRIGGER
  /* Is deferred triggering in effect? */

  if (!priv->defertrig)
    {
      /* No: start the DMAs now */

      spi_dmarxstart(priv);
      spi_dmatxstart(priv);
    }
  else
    {
      /* Yes: indicate that we are ready to be started */

      priv->trigarmed = true;
      return;
    }
#else
  /* Start the DMAs */

  spi_dmarxstart(priv);
  spi_dmatxstart(priv);
#endif

  /* Then wait for each to complete */

  ret = spi_dmarxwait(priv);
  if (ret < 0)
    {
      spi_dmatxwait(priv);
    }
  else
    {
      ret = spi_dmatxwait(priv);
    }

  /* Disable the SPI DMA requests */

  spi_modifyreg(priv, GD32VW55X_SPI_CTL1_OFFSET, 0,
                SPI_CTL1_DMAREN | SPI_CTL1_DMATEN);

#ifdef CONFIG_SPI_TRIGGER
  priv->trigarmed = false;
#endif
}
#endif /* CONFIG_GD32VW55X_SPI_DMA */

/****************************************************************************
 * Name: spi_trigger
 *
 * Description:
 *   Trigger a previously configured DMA transfer
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   OK       - Trigger was fired
 *   -ENOSYS  - Trigger not fired due to lack of DMA support
 *   -EIO     - Trigger not fired because not previously primed
 *
 ****************************************************************************/

#ifdef CONFIG_SPI_TRIGGER
static int spi_trigger(struct spi_dev_s *dev)
{
#ifdef CONFIG_GD32VW55X_SPI_DMA
  struct gd32_spidev_s *priv = (struct gd32_spidev_s *)dev;

  if (!priv->trigarmed)
    {
      return -EIO;
    }

  spi_dmarxstart(priv);
  spi_dmatxstart(priv);

  return OK;
#else
  return -ENOSYS;
#endif
}
#endif

/****************************************************************************
 * Name: spi_sndblock
 *
 * Description:
 *   Send a block of data on SPI
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   nwords   - The length of data to send from the buffer in number of
 *              words
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void spi_sndblock(struct spi_dev_s *dev, const void *txbuffer,
                         size_t nwords)
{
  spiinfo("txbuffer=%p nwords=%zu\n", txbuffer, nwords);
  spi_exchange(dev, txbuffer, NULL, nwords);
}

/****************************************************************************
 * Name: spi_recvblock
 *
 * Description:
 *   Receive a block of data from SPI
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - The length of data that can be received in the buffer in
 *              number of words
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_recvblock(struct spi_dev_s *dev, void *rxbuffer,
                          size_t nwords)
{
  spiinfo("rxbuffer=%p nwords=%zu\n", rxbuffer, nwords);
  spi_exchange(dev, NULL, rxbuffer, nwords);
}
#endif

/****************************************************************************
 * Name: spi_bus_initialize
 *
 * Description:
 *   Initialize the SPI bus in its default state (Master, 8-bit, mode 0)
 *
 * Input Parameters:
 *   priv - Private SPI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_bus_initialize(struct gd32_spidev_s *priv)
{
  uint32_t regval;

  /* Configure CTL0.  Default configuration:
   *
   *   Mode 0:                   CKPH=0 and CKPL=0
   *   Master:                   MSTMOD=1
   *   8-bit:                    FF16=0
   *   MSB transmitted first:    LF=0
   *   NSS software mode:        SWNSSEN=1
   *   Full duplex:              RO=0, BDEN=0
   */

  regval  = spi_getreg(priv, GD32VW55X_SPI_CTL0_OFFSET);
  regval &= SPI_INIT_MASK;
  regval |= (SPI_MASTER | SPI_CTL0_SWNSSEN);
  spi_putreg(priv, GD32VW55X_SPI_CTL0_OFFSET, regval);

  /* CTL1: no DMA, no interrupts, no TI mode */

  spi_putreg(priv, GD32VW55X_SPI_CTL1_OFFSET, 0);

  priv->frequency = 0;
  priv->nbits     = 8;
  priv->mode      = SPIDEV_MODE0;

  /* Select a default frequency of approximately 400 KHz */

  spi_setfrequency((struct spi_dev_s *)priv, GD32_SPI_CLK_INIT);

#ifdef CONFIG_GD32VW55X_SPI_DMA
  if (priv->txdma == NULL && priv->rxdma == NULL)
    {
      /* Get the DMA channels */

      priv->rxdma = gd32_dma_channel_alloc(priv->rxch);
      priv->txdma = gd32_dma_channel_alloc(priv->txch);
      DEBUGASSERT(priv->rxdma != NULL && priv->txdma != NULL);
    }
#endif

  /* Enable the SPI */

  spi_modifyreg(priv, GD32VW55X_SPI_CTL0_OFFSET, SPI_CTL0_SPIEN, 0);
}

/****************************************************************************
 * Name: gd32_spi_gpio_config
 *
 * Description:
 *   Configure the GPIO pins of the SPI: SCK, MISO and MOSI.  The chip
 *   select pins are configured by the board-specific logic.
 *
 ****************************************************************************/

static void gd32_spi_gpio_config(void)
{
  gd32_gpio_config(GPIO_SPI_SCK);
  gd32_gpio_config(GPIO_SPI_MISO);
  gd32_gpio_config(GPIO_SPI_MOSI);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_spi0select, gd32_spi0status and gd32_spi0cmddata
 *
 * Description:
 *   Weak default implementations of the board-specific SPI methods.  A
 *   board that has SPI slaves must override these.
 *
 ****************************************************************************/

void weak_function gd32_spi0select(struct spi_dev_s *dev, uint32_t devid,
                                   bool selected)
{
  spiwarn("WARNING: gd32_spi0select not provided by the board\n");
}

uint8_t weak_function gd32_spi0status(struct spi_dev_s *dev, uint32_t devid)
{
  return 0;
}

#ifdef CONFIG_SPI_CMDDATA
int weak_function gd32_spi0cmddata(struct spi_dev_s *dev, uint32_t devid,
                                   bool cmd)
{
  return -ENODEV;
}
#endif

/****************************************************************************
 * Name: gd32_spibus_initialize
 *
 * Description:
 *   Initialize the selected SPI bus
 *
 * Input Parameters:
 *   bus - The SPI bus number.  The GD32VW55x has a single SPI: bus 0.
 *
 * Returned Value:
 *   Valid SPI device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct spi_dev_s *gd32_spibus_initialize(int bus)
{
  struct gd32_spidev_s *priv = NULL;
  irqstate_t flags;

  if (bus != GD32VW55X_SPI_BUS)
    {
      spierr("ERROR: Unsupported SPI bus: %d\n", bus);
      return NULL;
    }

  priv  = &g_spi0dev;
  flags = enter_critical_section();

  /* Has the SPI already been initialized? */

