apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_spi.c
  if (!priv->initialized)
    {
      /* Configure the GPIO pins of the SPI */

      gd32_spi_gpio_config();

      /* Enable the SPI clock */

      gd32_spi_clock_enable();

      /* Set up the default configuration */

      spi_bus_initialize(priv);

      priv->initialized = true;
    }

  leave_critical_section(flags);

  return (struct spi_dev_s *)priv;
}

/****************************************************************************
 * Name: gd32_spibus_deinitialize
 *
 * Description:
 *   Deinitialize the selected SPI bus
 *
 * Input Parameters:
 *   bus - The SPI bus number
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void gd32_spibus_deinitialize(int bus)
{
  struct gd32_spidev_s *priv = NULL;
  irqstate_t flags;

  if (bus != GD32VW55X_SPI_BUS)
    {
      spierr("ERROR: Unsupported SPI bus: %d\n", bus);
      return;
    }

  priv  = &g_spi0dev;
  flags = enter_critical_section();

  if (priv->initialized)
    {
#ifdef CONFIG_GD32VW55X_SPI_DMA
      if (priv->rxdma != NULL)
        {
          gd32_dma_channel_free(priv->rxdma);
          priv->rxdma = NULL;
        }

      if (priv->txdma != NULL)
        {
          gd32_dma_channel_free(priv->txdma);
          priv->txdma = NULL;
        }
#endif

      /* Disable the SPI and its clock, then reset the peripheral */

      spi_modifyreg(priv, GD32VW55X_SPI_CTL0_OFFSET, 0, SPI_CTL0_SPIEN);

      gd32_spi_clock_disable();
      gd32_spi_reset();

      priv->initialized = false;
    }

  leave_critical_section(flags);
}

#endif /* CONFIG_GD32VW55X_SPI */
